unit DevelopingDiary;
interface
{
                                       ...Может кому-то будет интересно
                                                                     .Я
  
  19.07.06
  Утром отдебажил пару серьёзных глюков-артефактов в рендере.
  Вечером сделал прикольное "шейдерное" появление меню.
  Главная проблема: где найти хоть какого-нибудь художника или
  моделлера? Кароче, всё опять будет схематично: 2D + квадратики
  и прямоугольнички.

  20.07.06
  Утро... Наполеоновские планы...
  Появилось желание сделать в игре коментарии разработчиков. Хм.
  Пора завязывать с Халвой:) Думаю как лучше сделать интерфейс, а
  то опять окошки что-то не очень хочеться. Есть идейка сделать
  возможность посылать highscores в Интернет, но это надо php
  вспоминать. Пойду лучше поем :)
  Вечер. Наигрался в Heroes III: WoG до посинения...Начал делать 
  первый комментарии разработчика. Хватило бы времени на все задумки...

  21.07.06
  Сделал коментарии. Начал делать main menu. Не могу решиться как 
  будет красивее :) Экспериментрую/Перебираю варианты оформления/Подбираю
  цвета/Пытаюсь креативить. С точки зрения программирования - ничего не
  делал весь день.

  22.07.06
  Выходные...Работоспособность падает до нуля. Вроде определился со 
  графчастью главного меню, пора заняться программной частью. Ещё 
  отказался от Highscores. Ну какие Highscores в сокобане? И 
  добавлять поддержку Highscores для пользовательских уровней?

  23.07.06
  Сделал главное меню. Написал содержимое ещё одного коментария. 
  Что-то сегодня у меня не творческое настроение. Завтра будет 
  новый день :)

  25.07.06
  Нового дня не получилось :| За день почти сделал About menu. Когда 
  буду делать саму игру? Зато какое будет About-меню! C "синусоидной 
  водичкой" :0 Главная гордость.

  27.07.06
  Начал делать меню выбора уровня(саму игру на потом :) ) Вчера было 
  день рождения => 0 байт нового кода :) Что-то текстур много набралось 
  видно придётся юзать unrar.dll т.к. распаковку 7z-архивов(лучше чем rar)
  с С перевести не успею :(

  03.08.06
  Что-то я забросил дневник. Так всегда случается. Всегда, когда начинаешь 
  делать что-то новое, в самом начале рвение самое большое. Так и с дневником
  - сначала писал каждый день, а сейчас вот. А вообще-то мне осталась шлифовка: 
  передрать уровни из Visual Sokoban, написать ещё пару комментариев и ещё 
  парочка мелочей.

  04.08.06
  Финишная прямая.
  Осталось сделать проверку победы... Шлифовка, шлифовка и ещё раз шлифовка :)
  
  05.08.06
  За день доделал почти всё, что хотел. Потом отослал Груздеву 218-ый билд на 
  тестинг. Пре-релиз/Альфа так сказать. А вечером сел да и собрал инсталлер! 
  Вот так. Релиз уже совсем близко. Осталось только уровней навыдирать из 
  Visual Sokoban и пару ридмишек написать и...собрать финальный инсталл!!!

  Жизнь после смерти:
  На конкурс был отослан 224 build. Ужал unrar.dll upx'ом. Специально поставил
  Delphi2005 и sokoban.exe тоже ужал upx'ом(exe'шники, откомпилированные под
  Delphi2006 upx жать не хотел :( ). Игра заняла третье место. SeaBattle и то
  лучше - второе, но там было всего 3 участика, а тут 7. Честно говоря
  я ожидал лучшего. Но видимо, остальным участникам стиль не так важен. Им
  нравиться midi'ная музыка - а я её не переношу. А засунуть в игру полноценную
  mp3-шку не позволяют ограничения на размер дистрибутива. Им больше понравилось
  "пиво", чем стиль, в конце-концов. Надо что-то менять. Потом к проекту я
  прикрутил lzma-компессию, что позволило сэкономить ещё 61Kb, и игра стала весить
  325Kb(229-ый билд).


}
implementation
end.
